Revit 2027 API
ValueAtPointBase.GetFlags Method
 Returns flags for the given measurement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetFlags(
	int measurement
)
Public Function GetFlags (
	measurement As Integer
) As Integer
public:
int GetFlags(
	int measurement
)
member GetFlags :
        measurement : int -> int
Parameters
measurement Int32
 Measurement number for which flags are returned.
Return Value
Int32
 Flags value for the measurement.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for measurement is negative.
See Also
Reference
ValueAtPointBase Class
Autodesk.Revit.DB Namespace